#Exercicis amb MySQL.
#Ejercicios con MySQL.
#Exercises with MySQL.

- Exercici 1

A partir dels documents adjunts (estructura i dades), crea una base de dades amb MySQL. Mostra les característiques principals de l'esquema creat i explica les diferents taules i variables que hi ha.

- Ejercicio 1

A partir de los documentos adjuntos (estructura y datos), crea una base de datos con MySQL. Muestra las principales características del esquema creado y explica las diferentes tablas y variables existentes.

- Exercise 1

From the attached documents (structure and data), create a database with MySQL. It shows the main features of the created schema and explains the different tables and variables in it.

In [3]:
import mysql.connector
from mysql.connector import Error

In [71]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="...",
  db="movies"
)

cursor = mydb.cursor()

In [3]:
cursor.execute("CREATE SCHEMA IF NOT EXISTS movies")

In [4]:
cursor.execute("""CREATE TABLE IF NOT EXISTS movies.tb_genre (
    genre_id         INTEGER NOT NULL ,
    genre_name       CHARACTER VARYING(40) NOT NULL ,
    created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
    created_date     DATE ,
    updated_date     DATE ,
    CONSTRAINT pk_genre PRIMARY KEY (genre_id))"""
    )

In [5]:
tmoviestbmovie = """CREATE TABLE  IF NOT EXISTS movies.tb_movie ( 
    movie_id         INTEGER NOT NULL ,  
    movie_title      CHARACTER VARYING(100) NOT NULL ,
    movie_date       DATE ,
    movie_format     CHARACTER VARYING(50) ,
    movie_genre_id   INTEGER ,
    created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
    created_date     DATE ,
    updated_date     DATE ,
    CONSTRAINT pk_movie PRIMARY KEY (movie_id) ,
    CONSTRAINT fk_movie_genre FOREIGN KEY (movie_genre_id) REFERENCES movies.tb_genre (genre_id))"""

In [6]:
cursor.execute(tmoviestbmovie)

In [7]:
Tmoviestb_role = """CREATE TABLE IF NOT EXISTS movies.tb_role (
  role_id          INTEGER NOT NULL ,
  role_name        CHARACTER VARYING(60) NOT NULL ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_role PRIMARY KEY (role_id))"""

In [8]:
cursor.execute(Tmoviestb_role)

In [9]:
tmoviestb_person = """CREATE TABLE IF NOT EXISTS movies.tb_person (
  person_id        INTEGER NOT NULL ,
  person_name      CHARACTER VARYING(100) NOT NULL ,
  person_country   CHARACTER VARYING(40) , 
  person_dob       DATE NOT NULL ,
  person_dod       DATE ,
  person_parent_id INTEGER ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_person PRIMARY KEY (person_id) ,
  CONSTRAINT fk_person_parent FOREIGN KEY (person_parent_id) REFERENCES movies.tb_person (person_id))"""

In [10]:
cursor.execute(tmoviestb_person)

In [11]:
tmoviestb_movie_person = """CREATE TABLE IF NOT EXISTS movies.tb_movie_person (
  movie_id         INTEGER NOT NULL ,
  person_id        INTEGER NOT NULL ,
  role_id          INTEGER NOT NULL ,
  movie_award_ind  CHAR(1) NOT NULL ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_movper PRIMARY KEY (movie_id, person_id, role_id) ,
  CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) REFERENCES movies.tb_movie (movie_id) ,
  CONSTRAINT fk_movper_person FOREIGN KEY (person_id) REFERENCES movies.tb_person (person_id) ,
  CONSTRAINT fk_movper_role FOREIGN KEY (role_id) REFERENCES movies.tb_role (role_id)
  )"""

In [12]:
cursor.execute(tmoviestb_movie_person)

In [22]:
Datatb_genre = """
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 1, 'Acción');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 2, 'Ciencia Ficción');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 3, 'Comedia');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 4, 'Drama');\
INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user) VALUES ( 5, 'Fantasía', 'apermag');\
INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( 6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 7, 'Musical');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 8, 'Romance');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 9, 'Suspense');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (10, 'Terror');\
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (11, 'Bélico');
"""

In [25]:
sql = "DELETE FROM movies.tb_genre"
cursor.execute(sql)

# Guardar los cambios 
mydb.commit()

In [26]:
for result in cursor.execute(Datatb_genre, multi=True):
  if result.with_rows:
    print("Rows produced by statement '{}':".format(result.statement))
    print(result.fetchall())
  else:
    print("Number of rows affected by statement '{}': {}".format(result.statement, result.rowcount))


mydb.commit()

Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 1, 'Acción')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 2, 'Ciencia Ficción')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 3, 'Comedia')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 4, 'Drama')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user) VALUES ( 5, 'Fantasía', 'apermag')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( 6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 7, 'Musical')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 8, 'Romance')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 9, 'Suspense')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (10, 'Terror')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (11, 'Bélico')': 1

In [27]:
Datatb_movie = """
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 1, 'Apocalypse Now', '1979-05-10', 'Film', 11);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 4, 'The Terminal', '2004-06-18', 'Digital', 3);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 5, 'Jaws', '1975-01-01', 'Film', 10);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 7, 'Psycho', '1960-05-06', 'Film', 9);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (12, 'El dia de la bestia', '1994-12-25', 'Film', 1);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (13, 'Braveheart', '1995-08-08', 'Film', 4);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (15, 'Las brujas de Zugarramurdi', '2009-10-07', 'Digital', 9);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (16, 'Blade Runner', '1982-12-25', 'Digital', 2)"""

In [28]:
for result in cursor.execute(Datatb_movie, multi=True):
  if result.with_rows:
    print("Rows produced by statement '{}':".format(result.statement))
    print(result.fetchall())
  else:
    print("Number of rows affected by statement '{}': {}".format(result.statement, result.rowcount))


mydb.commit()

Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 1, 'Apocalypse Now', '1979-05-10', 'Film', 11)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 4, 'The Terminal', '2004-06-18', 'Digital', 3)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 5, 'Jaws', '1975-01-01', 'Film', 10)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 7, 'Psycho', '1960-05-06', 'Film', 9)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (12, 'El dia de la bestia', '1994-12-25', 'Film', 1)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (13, 'Braveheart', '1995-08-08', 'Film', 4)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (15, 'Las brujas de Zugarramurdi', '2009-10-07', 'Digital', 9)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (16, 'Blade Runner', '1982-12-25', 'Digital', 2)': 1

In [29]:
Datatb_role = """
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 1, 'Actor');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 2, 'Director');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 3, 'Productor');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 4, 'Guionista');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 5, 'Música');
"""

In [30]:
for result in cursor.execute(Datatb_role, multi=True):
  if result.with_rows:
    print("Rows produced by statement '{}':".format(result.statement))
    print(result.fetchall())
  else:
    print("Number of rows affected by statement '{}': {}".format(result.statement, result.rowcount))


mydb.commit()

Number of rows affected by statement 'INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 1, 'Actor')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 2, 'Director')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 3, 'Productor')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 4, 'Guionista')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 5, 'Música')': 1

In [32]:
Datatb_person = """
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 2, 'Carmine Coppola', 'United States', '1945-07-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 4, 'Robert Duvall', 'United States', '1931-01-05', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 5, 'Martin Sheen', 'United States', '1940-08-03', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 6, 'Harrison Ford', 'United States', '1942-07-13', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 7, 'George Lucas', 'United States', '1944-05-14', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 8, 'Gary Kurtz', 'United States', '1940-07-27', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 9, 'Steven Spielberg', 'United States', '1946-12-18', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (10, 'John Williams', 'United States', '1928-08-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (11, 'Tom Hanks', 'United States', '1956-07-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (15, 'Vera Miles', 'United States', '1929-08-23', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (17, 'Dani Rovira', 'Spain', '1984-07-01', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (18, 'Clara Lago', 'Spain', '1986-04-17', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (19, 'Carmen Machi', 'Spain', '1964-08-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (20, 'Karra Elejalde', 'Spain', '1960-03-06', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (22, 'Quim Gutierrez', 'Spain', '1981-03-27', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (23, 'Robert Alamo', 'Spain', '1970-05-06', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (25, 'Veronica Echegui', 'Spain', '1983-03-14', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (26, 'Patrick Criado', 'Spain', '1995-09-23', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (27, 'Sean Connery', 'Scotland', '1930-07-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (28, 'Mel Gibson', 'Australia', '1950-08-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (29, 'Morgan Freeman', 'United States', '1935-10-01', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (30, 'Tim Robbins', 'United States', '1949-06-07', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (41, 'Charlie Sheen', 'United States', '1965-09-03', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (42, 'Emilio Estevez', 'United States', '1962-05-12', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (43, 'Ramón Estevez', 'United States', '1963-08-07', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (44, 'Reneé Estevez', 'United States', '1967-04-02', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (45, 'Paula Speert Sheen', 'United States', '1986-01-06', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (46, 'Bob Sheen', 'United States', '2009-05-01', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (47, 'Max Sheen', 'United States', '2009-05-01', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (48, 'Sam Sheen', 'United States', '2004-03-09', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (49, 'Lola Sheen', 'United States', '2005-06-01', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (50, 'Paula Jones-Sheen', 'United States', '2003-07-06', NULL,45);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (51, 'Paloma Rae Estevez', 'United States', '1986-02-15', NULL,42);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (52, 'Taylor Levi Estevez', 'United States', '1984-06-22', NULL,42);

"""

In [33]:
for result in cursor.execute(Datatb_person, multi=True):
  if result.with_rows:
    print("Rows produced by statement '{}':".format(result.statement))
    print(result.fetchall())
  else:
    print("Number of rows affected by statement '{}': {}".format(result.statement, result.rowcount))


mydb.commit()

Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 2, 'Carmine Coppola', 'United States', '1945-07-08', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 4, 'Robert Duvall', 'United States', '1931-01-05', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 5, 'Martin Sheen', 'United States', '1940-08-03', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 6, 'Harrison Ford', 'United States', '1942-07-13', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 7, 'George Lucas', 'United States', '1944-05-14', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 8, 'Gary Kurtz', 'United States', '1940-07-27', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 9, 'Steven Spielberg', 'United States', '1946-12-18', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (10, 'John Williams', 'United States', '1928-08-08', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (11, 'Tom Hanks', 'United States', '1956-07-09', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (15, 'Vera Miles', 'United States', '1929-08-23', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (17, 'Dani Rovira', 'Spain', '1984-07-01', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (18, 'Clara Lago', 'Spain', '1986-04-17', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (19, 'Carmen Machi', 'Spain', '1964-08-09', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (20, 'Karra Elejalde', 'Spain', '1960-03-06', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (22, 'Quim Gutierrez', 'Spain', '1981-03-27', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (23, 'Robert Alamo', 'Spain', '1970-05-06', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (25, 'Veronica Echegui', 'Spain', '1983-03-14', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (26, 'Patrick Criado', 'Spain', '1995-09-23', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (27, 'Sean Connery', 'Scotland', '1930-07-08', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (28, 'Mel Gibson', 'Australia', '1950-08-09', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (29, 'Morgan Freeman', 'United States', '1935-10-01', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (30, 'Tim Robbins', 'United States', '1949-06-07', NULL, NULL)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (41, 'Charlie Sheen', 'United States', '1965-09-03', NULL, 5)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (42, 'Emilio Estevez', 'United States', '1962-05-12', NULL, 5)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (43, 'Ramón Estevez', 'United States', '1963-08-07', NULL, 5)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (44, 'Reneé Estevez', 'United States', '1967-04-02', NULL, 5)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (45, 'Paula Speert Sheen', 'United States', '1986-01-06', NULL,41)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (46, 'Bob Sheen', 'United States', '2009-05-01', NULL,41)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (47, 'Max Sheen', 'United States', '2009-05-01', NULL,41)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (48, 'Sam Sheen', 'United States', '2004-03-09', NULL,41)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (49, 'Lola Sheen', 'United States', '2005-06-01', NULL,41)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (50, 'Paula Jones-Sheen', 'United States', '2003-07-06', NULL,45)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (51, 'Paloma Rae Estevez', 'United States', '1986-02-15', NULL,42)': 1
Number of rows affected by statement 'INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (52, 'Taylor Levi Estevez', 'United States', '1984-06-22', NULL,42)': 1

In [34]:
Datatb_movie_person = """
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 2, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 5, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 2, 5, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 3, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 4, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 5, 1, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1,41, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 6, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 6, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 7, 2, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 8, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 6, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 4, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3,10, 5, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,11, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,12, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 5, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 6, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,14, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,15, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,16, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,16, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,17, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,18, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,19, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,20, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,17, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,18, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,19, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,20, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (10,16, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 4, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,22, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,23, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,24, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,25, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,26, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 1, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,29, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,30, 1, 'N');
"""

In [35]:
for result in cursor.execute(Datatb_movie_person, multi=True):
  if result.with_rows:
    print("Rows produced by statement '{}':".format(result.statement))
    print(result.fetchall())
  else:
    print("Number of rows affected by statement '{}': {}".format(result.statement, result.rowcount))


mydb.commit()

Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 2, 'Y')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 3, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 5, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 2, 5, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 3, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 4, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 5, 1, 'Y')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1,41, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 6, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 6, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 7, 2, 'Y')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 8, 3, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 6, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 4, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 9, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3,10, 5, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 3, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,11, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,12, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 5, 9, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 6, 9, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 3, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,14, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,15, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,16, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,16, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,17, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,18, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,19, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,20, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,17, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,18, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,19, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,20, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (10,16, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 4, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,22, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,23, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,24, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,25, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,26, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 1, 'Y')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 2, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,29, 1, 'N')': 1
Number of rows affected by statement 'INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,30, 1, 'N')': 1

L'esquema creat té diverses taules que s'utilitzen per emmagatzemar informació relacionada amb pel·lícules, gèneres, persones i rols. A continuació, t'explico les principals característiques de l'esquema i les diferents taules i variables existents:

1. Taula "tb_genre":
   - Característiques:
     - Nom de la taula: tb_genre
     - Columnes: genre_id, genre_name, created_by_user, created_date, updated_date
     - Restriccions:
       - Clau primària (pk_genre) a la columna genre_id

   Aquesta taula s'utilitza per emmagatzemar informació sobre els gèneres de les pel·lícules. Cada gènere té un identificador únic (genre_id) i un nom (genre_name). També s'enregistra qui ha creat el registre (created_by_user), així com les dates de creació (created_date) i actualització (updated_date) del registre.

2. Taula "tb_movie":
   - Característiques:
     - Nom de la taula: tb_movie
     - Columnes: movie_id, movie_title, movie_date, movie_format, movie_genre_id, created_by_user, created_date, updated_date
     - Restriccions:
       - Clau primària (pk_movie) a la columna movie_id
       - Clau externa (fk_movie_genre) a la columna movie_genre_id que fa referència a la taula tb_genre (columna genre_id)

   Aquesta taula s'utilitza per emmagatzemar informació sobre les pel·lícules. Cada pel·lícula té un identificador únic (movie_id), títol (movie_title), data de publicació (movie_date), format (movie_format) i gènere (movie_genre_id). El camp created_by_user enregistra qui ha creat el registre, i les dates created_date i updated_date indiquen quan es va crear i actualitzar el registre, respectivament.

3. Taula "tb_role":
   - Característiques:
     - Nom de la taula: tb_role
     - Columnes: role_id, role_name, created_by_user, created_date, updated_date
     - Restriccions:
       - Clau primària (pk_role) a la columna role_id

   Aquesta taula emmagatzema informació sobre els rols a les pel·lícules. Cada rol té un identificador únic (role_id) i un nom (role_name). Com en les altres taules, s'enregistra qui ha creat el registre (created_by_user), així com les dates de creació (created_date) i actualització (updated_date).

4. Taula "tb_person":
   - Característiques:
     - Nom de la taula: tb_person
     - Columnes: person_id, person_name, person_country, person_dob, person_dod, person_parent_id, created_by_user, created_date, updated_date
     - Restriccions:
       - Clau primària (pk_person) a la columna person_id
- Clau externa (fk_person_parent) a la columna person_parent_id que fa referència a la taula tb_person (columna person_id)

Aquesta taula s'utilitza per emmagatzemar informació sobre les persones involucrades en les pel·lícules. Cada persona té un identificador únic (person_id), nom (person_name), país (person_country), data de naixement (person_dob) i data de defunció (person_dod). A més, hi ha una columna person_parent_id que estableix una relació jeràrquica entre les persones, on una persona pot tenir un pare/mare representat per un altre registre a la mateixa taula. Al igual que en les altres taules, s'enregistra qui ha creat el registre (created_by_user), així com les dates de creació (created_date) i actualització (updated_date) del registre.

--------------------------------------------------------------------

El esquema creado tiene varias tablas que se utilizan para almacenar información relacionada con películas, géneros, personas y roles. A continuación, te mostraré las principales características del esquema y explicaré las diferentes tablas y variables existentes:

1. Tabla "tb_genre":
   - Características:
     - Nombre de la tabla: tb_genre
     - Columnas: genre_id, genre_name, created_by_user, created_date, updated_date
     - Restricciones:
       - Clave primaria (pk_genre) en la columna genre_id

   Esta tabla se utiliza para almacenar información sobre los géneros de las películas. Cada género tiene un identificador único (genre_id) y un nombre (genre_name). También se registra quién creó el registro (created_by_user) y las fechas de creación (created_date) y actualización (updated_date) del registro.

2. Tabla "tb_movie":
   - Características:
     - Nombre de la tabla: tb_movie
     - Columnas: movie_id, movie_title, movie_date, movie_format, movie_genre_id, created_by_user, created_date, updated_date
     - Restricciones:
       - Clave primaria (pk_movie) en la columna movie_id
       - Clave externa (fk_movie_genre) en la columna movie_genre_id que referencia a la tabla tb_genre (columna genre_id)

   Esta tabla se utiliza para almacenar información sobre las películas. Cada película tiene un identificador único (movie_id), título (movie_title), fecha de lanzamiento (movie_date), formato (movie_format) y género (movie_genre_id). El campo created_by_user registra quién creó el registro, y las fechas created_date y updated_date indican cuándo se creó y actualizó el registro respectivamente.

3. Tabla "tb_role":
   - Características:
     - Nombre de la tabla: tb_role
     - Columnas: role_id, role_name, created_by_user, created_date, updated_date
     - Restricciones:
       - Clave primaria (pk_role) en la columna role_id

   Esta tabla almacena información sobre los roles en las películas. Cada rol tiene un identificador único (role_id) y un nombre (role_name). Al igual que en las otras tablas, se registra quién creó el registro (created_by_user) y las fechas de creación (created_date) y actualización (updated_date).

4. Tabla "tb_person":
   - Características:
     - Nombre de la tabla: tb_person
     - Columnas: person_id, person_name, person_country, person_dob, person_dod, person_parent_id, created_by_user, created_date, updated_date
     - Restricciones:
       - Clave primaria (pk_person) en la columna person_id
       - Clave externa (fk_person_parent) en la columna person_parent_id que referencia a la tabla tb_person (columna person_id)

   Esta tabla se utiliza para almacenar información sobre las personas involucradas en las películas. Cada persona tiene un identificador único (person_id), nombre (person_name), país (person_country), fecha de nacimiento (person_dob) y fecha de fallecimiento (person_dod). Además, hay una columna person_parent_id que establece una relación jerárquica entre las personas, donde una persona puede tener un padre/madre representado por otro registro en la misma tabla. Al igual que en las otras, se registra quién creó el registro (created_by_user), así como las fechas de creación (created_date) y actualización (updated_date) del registro.

   ------------------------------------------------------------

   The created schema has several tables that are used to store information related to movies, genres, people, and roles. I will now show you the main features of the schema and explain the different tables and variables present:

1. Table "tb_genre":
   - Features:
     - Table name: tb_genre
     - Columns: genre_id, genre_name, created_by_user, created_date, updated_date
     - Constraints:
       - Primary key (pk_genre) on the genre_id column

   This table is used to store information about movie genres. Each genre has a unique identifier (genre_id) and a name (genre_name). The creator of the record is also recorded (created_by_user), along with the creation date (created_date) and update date (updated_date) of the record.

2. Table "tb_movie":
   - Features:
     - Table name: tb_movie
     - Columns: movie_id, movie_title, movie_date, movie_format, movie_genre_id, created_by_user, created_date, updated_date
     - Constraints:
       - Primary key (pk_movie) on the movie_id column
       - Foreign key (fk_movie_genre) on the movie_genre_id column referencing the tb_genre table (genre_id column)

   This table is used to store information about movies. Each movie has a unique identifier (movie_id), title (movie_title), release date (movie_date), format (movie_format), and genre (movie_genre_id). The created_by_user field records who created the record, and the created_date and updated_date fields indicate when the record was created and updated, respectively.

3. Table "tb_role":
   - Features:
     - Table name: tb_role
     - Columns: role_id, role_name, created_by_user, created_date, updated_date
     - Constraints:
       - Primary key (pk_role) on the role_id column

   This table stores information about roles in movies. Each role has a unique identifier (role_id) and a name (role_name). Similar to the other tables, the creator of the record is recorded (created_by_user), and the creation date (created_date) and update date (updated_date) are also stored.

4. Table "tb_person":
   - Features:
     - Table name: tb_person
     - Columns: person_id, person_name, person_country, person_dob, person_dod, person_parent_id, created_by_user, created_date, updated_date
     - Constraints:
       - Primary key (pk_person) on the person_id column
       - Foreign key (fk_person_parent) on the person_parent_id column referencing the tb_person table (person_id column)

   This table is used to store information about people involved in movies. Each person has a unique identifier (person_id), name (person_name), country (person_country), date of birth (person_dob), and date of death (person_dod). Additionally, there is a person_parent_id column that establishes a hierarchical relationship between people, where a person can have a parent represented by another record in the same table. Similar to the other tables, the creator of the record is recorded (created_by_user), and the creation date (created_date) and update date (updated_date) are also stored.

![D](Diagram.png 'Diagram')


- Exercici 2

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom, el país i la data de naixement d'aquelles persones per les quals no consti una data de mort i ordenar les dades de la persona més vella a la persona més jove.

- Ejercicio 2

Realiza la siguiente consulta sobre la recién creada base de datos:

Tienes que obtener el nombre, el país y la fecha de nacimiento de aquellas personas por las que no conste una fecha de muerte y ordenar los datos de la persona más vieja a la persona más joven.

- Exercise 2

Run the following query on the newly created database:

You must obtain the name, country and date of birth of those persons for whom there is no date of death and order the data from the oldest person to the youngest person.

In [41]:
ex2 = """SELECT person_name, person_country, person_dob
FROM movies.tb_person
WHERE person_dod IS NULL
ORDER BY person_dob ASC;"""

In [47]:
cursor.execute(ex2)
resultados = cursor.fetchall()

# Imprimir los resultados
for resultado in resultados:
    nombre = resultado[0]
    pais = resultado[1]
    fecha_nacimiento = resultado[2]
    print(f"Nombre: {nombre}, País: {pais}, Fecha de nacimiento: {fecha_nacimiento}")

Nombre: John Williams, País: United States, Fecha de nacimiento: 1928-08-08
Nombre: Vera Miles, País: United States, Fecha de nacimiento: 1929-08-23
Nombre: Sean Connery, País: Scotland, Fecha de nacimiento: 1930-07-08
Nombre: Robert Duvall, País: United States, Fecha de nacimiento: 1931-01-05
Nombre: Morgan Freeman, País: United States, Fecha de nacimiento: 1935-10-01
Nombre: Francis Ford Coppola, País: United States, Fecha de nacimiento: 1939-04-07
Nombre: Gary Kurtz, País: United States, Fecha de nacimiento: 1940-07-27
Nombre: Martin Sheen, País: United States, Fecha de nacimiento: 1940-08-03
Nombre: Harrison Ford, País: United States, Fecha de nacimiento: 1942-07-13
Nombre: George Lucas, País: United States, Fecha de nacimiento: 1944-05-14
Nombre: Carmine Coppola, País: United States, Fecha de nacimiento: 1945-07-08
Nombre: Steven Spielberg, País: United States, Fecha de nacimiento: 1946-12-18
Nombre: Tim Robbins, País: United States, Fecha de nacimiento: 1949-06-07
Nombre: Mel Gibson, País: Australia, Fecha de nacimiento: 1950-08-09
Nombre: Tom Hanks, País: United States, Fecha de nacimiento: 1956-07-09
Nombre: Emilio Martinez Lazaro, País: Spain, Fecha de nacimiento: 1956-09-09
Nombre: Karra Elejalde, País: Spain, Fecha de nacimiento: 1960-03-06
Nombre: Emilio Estevez, País: United States, Fecha de nacimiento: 1962-05-12
Nombre: Ramón Estevez, País: United States, Fecha de nacimiento: 1963-08-07
Nombre: Carmen Machi, País: Spain, Fecha de nacimiento: 1964-08-09
Nombre: Charlie Sheen, País: United States, Fecha de nacimiento: 1965-09-03
Nombre: Reneé Estevez, País: United States, Fecha de nacimiento: 1967-04-02
Nombre: Catherine Zeta-Jones, País: Wales, Fecha de nacimiento: 1969-09-25
Nombre: Robert Alamo, País: Spain, Fecha de nacimiento: 1970-05-06
Nombre: Daniel Sanchez Arevalo, País: Spain, Fecha de nacimiento: 1970-06-08
Nombre: Quim Gutierrez, País: Spain, Fecha de nacimiento: 1981-03-27
Nombre: Veronica Echegui, País: Spain, Fecha de nacimiento: 1983-03-14
Nombre: Taylor Levi Estevez, País: United States, Fecha de nacimiento: 1984-06-22
Nombre: Dani Rovira, País: Spain, Fecha de nacimiento: 1984-07-01
Nombre: Paula Speert Sheen, País: United States, Fecha de nacimiento: 1986-01-06
Nombre: Paloma Rae Estevez, País: United States, Fecha de nacimiento: 1986-02-15
Nombre: Clara Lago, País: Spain, Fecha de nacimiento: 1986-04-17
Nombre: Patrick Criado, País: Spain, Fecha de nacimiento: 1995-09-23
Nombre: Paula Jones-Sheen, País: United States, Fecha de nacimiento: 2003-07-06
Nombre: Sam Sheen, País: United States, Fecha de nacimiento: 2004-03-09
Nombre: Lola Sheen, País: United States, Fecha de nacimiento: 2005-06-01
Nombre: Bob Sheen, País: United States, Fecha de nacimiento: 2009-05-01
Nombre: Max Sheen, País: United States, Fecha de nacimiento: 2009-05-01

- Exercici 3

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom del gènere i el nombre total de pel·lícules d'aquest gènere i ordenar-ho per ordre descendent de nombre total de pel·lícules.  

- Ejercicio 3

Realiza la siguiente consulta sobre la recién creada base de datos:

Tienes que obtener el nombre del género y el número total de películas de ese género y ordenarlo por orden descendente de número total de películas.

- Exercise 3

Run the following query on the newly created database:

You need to get the genre name and the total number of movies in that genre and sort it in descending order of total number of movies.

In [57]:
ex3 ="""SELECT COUNT(genre_name) AS gn_count, genre_name FROM tb_movie \
       INNER JOIN tb_genre WHERE tb_genre.genre_id = tb_movie.movie_genre_id \
       GROUP BY genre_name \
       ORDER BY gn_count DESC"""

In [59]:
cursor.execute(ex3)
resultados = cursor.fetchall()

for resultado in resultados:
    genero = resultado[1]
    total_peliculas = resultado[0]
    print(f"Género: {genero}, Total de películas: {total_peliculas}")

Género: Comedia, Total de películas: 3
Género: Acción, Total de películas: 2
Género: Ciencia Ficción, Total de películas: 2
Género: Drama, Total de películas: 2
Género: Romance, Total de películas: 2
Género: Suspense, Total de películas: 2
Género: Fantasía, Total de películas: 1
Género: Terror, Total de películas: 1
Género: Bélico, Total de películas: 1

- Exercici 4

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir, per a cada persona, el seu nom i el nombre màxim de rols diferents que ha tingut en una mateixa pel·lícula. 

Posteriorment, mostra únicament aquelles persones que hagin assumit més d'un rol en una mateixa pel·lícula.

- Ejercicio 4

Realiza la siguiente consulta sobre la recién creada base de datos:

Tienes que obtener, para cada persona, su nombre y el número máximo de roles distintos que ha tenido en una misma película.

Posteriormente, muestra únicamente a aquellas personas que hayan asumido más de un rol en una misma película.

- Exercise 4

Run the following query on the newly created database:

You need to get, for each person, their name and the maximum number of different roles they have had in the same movie.

Subsequently, it only shows those people who have assumed more than one role in the same film.

In [75]:
ex4 = """SELECT p.person_name, MAX(role_count) AS max_roles
FROM (
    SELECT mp.person_id, COUNT(DISTINCT mp.role_id) AS role_count
    FROM movies.tb_movie_person mp
    GROUP BY mp.person_id, mp.movie_id
    HAVING COUNT(DISTINCT mp.role_id) > 1
) AS subquery
JOIN movies.tb_person p ON subquery.person_id = p.person_id
GROUP BY p.person_name
HAVING MAX(role_count) > 1
ORDER BY max_roles DESC;"""

In [77]:
cursor.execute(ex4)
resultados = cursor.fetchall()

# Imprimir los resultados
for resultado in resultados:
    person_name = resultado[0]
    max_roles = resultado[1]
    #movie_title = resultado[2]
    print(f"Persona: {person_name}, Roles máximos en una película: {max_roles}")

Persona: Francis Ford Coppola, Roles máximos en una película: 3
Persona: Alfred Joseph Hitchcock, Roles máximos en una película: 3
Persona: George Lucas, Roles máximos en una película: 2
Persona: Steven Spielberg, Roles máximos en una película: 2
Persona: Daniel Sanchez Arevalo, Roles máximos en una película: 2
Persona: Mel Gibson, Roles máximos en una película: 2

In [90]:
ex44 = """SELECT p.person_name, m.movie_title, MAX(role_count) AS max_roles
FROM (
    SELECT mp.person_id, mp.movie_id, COUNT(DISTINCT mp.role_id) AS role_count
    FROM movies.tb_movie_person mp
    GROUP BY mp.person_id, mp.movie_id
    HAVING COUNT(DISTINCT mp.role_id) > 1
) AS subquery
JOIN movies.tb_person p ON subquery.person_id = p.person_id
JOIN movies.tb_movie m ON subquery.movie_id = m.movie_id
GROUP BY p.person_name, m.movie_title
HAVING MAX(role_count) > 1
ORDER BY max_roles DESC;"""

In [92]:
cursor.execute(ex44)
resultados = cursor.fetchall()
for row in resultados:
    person_name = row[0]
    movie_title = row[1]
    max_roles = row[2]
    print(f"Persona: {person_name}, Película: {movie_title}, Máximo de roles: {max_roles}")

Persona: Francis Ford Coppola, Película: Apocalypse Now, Máximo de roles: 3
Persona: Alfred Joseph Hitchcock, Película: Psycho, Máximo de roles: 3
Persona: George Lucas, Película: Indiana Jones and the Temple of Doom, Máximo de roles: 2
Persona: Steven Spielberg, Película: The Terminal, Máximo de roles: 2
Persona: Daniel Sanchez Arevalo, Película: La Gran Familia Española, Máximo de roles: 2
Persona: Mel Gibson, Película: Braveheart, Máximo de roles: 2

- Exercici 5

Realitza la següent operació sobre la base de dades acabada de crear: 

Has de crear un nou gènere anomenat "Documental" el qual tingui com a identificador el nombre 69.

- Ejercicio 5

Realiza la siguiente operación sobre la base de datos recién creada:

Debes crear un nuevo género llamado "Documental" que tenga como identificador el número 69.

- Exercise 5

Perform the following operation on the newly created database:

You must create a new genre called "Documentary" which has the number 69 as its identifier.

In [4]:
ex5="""INSERT INTO movies.tb_genre (genre_id, genre_name)
VALUES (69, 'Documental');"""

In [ ]:
cursor.execute(ex5)

In [25]:
ex55 = """SELECT * FROM tb_genre WHERE genre_id = 69;"""

In [26]:
cursor.execute(ex55)
#result = cursor.fetchall()
results = [x for x in cursor.fetchall()]
print(results)

[(69, 'Documental', 'OS_SGAD', None, None)]

- Exercici 6

Fes la següent operació sobre la base de dades acabada de crear:  

Elimina la pel·lícula "La Gran Familia Española" de la base de dades.

- Ejercicio 6

Realiza la siguiente operación sobre la base de datos recién creada:

Elimina la película "La Gran Familia Española" de la base de datos.

- Exercise 6

Do the following operation on the newly created database:

Remove the movie "La Gran Familia Española" from the database.

In [36]:
ex6 ="""SELECT * FROM movies.tb_movie WHERE movie_title = 'La Gran Familia Española'"""
cursor.execute(ex6)
#result = cursor.fetchall()
results = [x for x in cursor.fetchall()]
print(results)

[(11, 'La Gran Familia Española', datetime.date(2012, 10, 15), 'Digital', 3, 'OS_SGAD', None, None)]

In [43]:
ex666 ="""DELETE FROM tb_movie WHERE movie_title = 'La Gran Familia Española'"""
cursor.execute(ex666)

In [44]:
ex6666="""SELECT * FROM tb_movie;"""
cursor.execute(ex6666)
#result = cursor.fetchall()
results = [x for x in cursor.fetchall()]
print(results)

[(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None), (2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None), (3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None), (4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None), (5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None), (6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None), (7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None), (8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None), (9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None), (10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None), (12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None), (13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None), (14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None), (15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None), (16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)]

In [46]:
sql = "SELECT COUNT(*) FROM tb_movie WHERE movie_title = 'La Gran Familia Española'"
cursor.execute(sql)

# Obtener el resultado de la consulta
result = cursor.fetchone()

# Comprobar si existe un registro
if result[0] > 0:
    print("El registro existe")
else:
    print("El registro no existe")

El registro no existe

- Exercici 7

Realitza la següent operació sobre la base de dades acabada de crear: 

Canvia el gènere de la pel·lícula "Ocho apellidos catalanes" perquè consti com a comèdia i no com a romàntica.

- Ejercicio 7

Realiza la siguiente operación sobre la base de datos recién creada:

Cambia el género de la película "Ocho apellidos catalanes" para que conste como comedia y no como romántica.

- Exercise 7

Perform the following operation on the newly created database:

Change the genre of the film "Ocho apellidos catalanes" so that it is recorded as a comedy and not as a romance.

In [66]:
sql = """UPDATE tb_genre, tb_movie 
         SET genre_name = 'Comedia', movie_genre_id = 3 
         WHERE movie_title = 'Ocho Apellidos Catalanes';"""
cursor.execute(sql)

In [69]:
sql = """SELECT * FROM tb_movie, tb_genre
       WHERE movie_title = 'Ocho Apellidos Catalanes';"""
cursor.execute(sql)
results = [x for x in cursor.fetchone()]
print(results)

[9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 3, 'OS_SGAD', None, None, 1, 'Comedia', 'OS_SGAD', None, None]

In [72]:
mydb.commit()
mydb.close()